src/Catalogs/НоменклатураГосЗакупок/НоменклатураГосЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураГосЗакупок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияГосЗакупок</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодичностьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаГруппы</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МногооборотнаяТара</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВМесте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НоменклатураГосЗакупок/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	
	Если НЕ Элементы.Номенклатура.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") тогда
		
		ТекущаяНоменклатура = Неопределено;
		Элементы.Номенклатура.ТекущиеДанные.Свойство("Номенклатура", ТекущаяНоменклатура);
		
		Если ЕстьДубликатыНоменклатуры(ТекущаяНоменклатура) тогда
			Элементы.Номенклатура.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Иначе
			Если ВернутьРеквизитОбъекта(ТекущаяНоменклатура, "ВидСтавкиНДС") <> Объект.ВидСтавкиНДС тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя вводить номенклатуру с отличной ставкой НДС!");
				Элементы.Номенклатура.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьРедактированияКоэффициента();
	
	Если Элементы.Номенклатура.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") тогда
		Элементы.Номенклатура.ТекущиеДанные.КоэффициентГосЗакупок = 0;
	Иначе
		Элементы.Номенклатура.ТекущиеДанные.КоэффициентГосЗакупок = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДубликатыНоменклатуры(ТекущаяНоменклатура)
	
	ОтборыСтрок = Новый Структура;
	ОтборыСтрок.Вставить("Номенклатура", ТекущаяНоменклатура);
	НайденыеСтроки = Объект.Номенклатура.НайтиСтроки(ОтборыСтрок);
	
	Если НайденыеСтроки.Количество() > 1 тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Номенклатура.ТекущаяСтрока = Неопределено тогда
		Элементы.НоменклатураКоэффициент.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьРедактированияКоэффициента();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРедактированияКоэффициента()
	
	ТекущаяНоменклатура = Неопределено;
	Элементы.Номенклатура.ТекущиеДанные.Свойство("Номенклатура", ТекущаяНоменклатура);
	
	Если ТекущаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")
	 ИЛИ НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияГосЗакупок) тогда
		Элементы.НоменклатураКоэффициент.ТолькоПросмотр = Истина;
	Иначе
		Если ВРЕГ(Объект.ЕдиницаИзмеренияГосЗакупок) = "КГ" ИЛИ ВРЕГ(Объект.ЕдиницаИзмеренияГосЗакупок) = "Л" тогда
			Если ВернутьРеквизитОбъекта(ТекущаяНоменклатура, "ЕдиницаИзмерения") = Объект.ЕдиницаИзмеренияГосЗакупок тогда
				Элементы.НоменклатураКоэффициент.ТолькоПросмотр = Истина;
			Иначе
				Элементы.НоменклатураКоэффициент.ТолькоПросмотр = Ложь;
			КонецЕсли;
		Иначе
			Элементы.НоменклатураКоэффициент.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьРеквизитОбъекта(Ссылка, Реквизит)
	
	Возврат Ссылка[Реквизит];
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.СтавкаНДС.РежимВыбораИзСписка = Истина;
	Элементы.СтавкаНДС.СписокВыбора.Очистить();
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыСтавокНДС Цикл
		Элементы.СтавкаНДС.СписокВыбора.Добавить(ЗначениеПеречисления,
			Строка(Перечисления.СтавкиНДС.СтавкаНДС(ЗначениеПеречисления, ТекущаяДатаПользователя)));
	КонецЦикла;
	
	НаименованияОдинаковы = Объект.Наименование = Объект.НаименованиеПолное;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.Номенклатура.Доступность = ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияГосЗакупок) И
		                                ЗначениеЗаполнено(Объект.ВидСтавкиНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НаименованияОдинаковы ИЛИ НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	НаименованияОдинаковы = Объект.НаименованиеПолное = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	НаименованияОдинаковы = Объект.НаименованиеПолное = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") тогда
		СтандартнаяОбработка = Ложь;
		НоменклатураНоменклатураОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	 УстановитьДоступностьРедактированияКоэффициента();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураНоменклатураОбработкаВыбораНаСервере(МассивЗначений)
	
	ЗаполнилиТекущуюСтроку = Ложь;
	
	Для Каждого Значение из МассивЗначений цикл
		
		Если НЕ ЕстьДубликатыНоменклатуры(Значение) тогда
			
			Если ВернутьРеквизитОбъекта(Значение, "ВидСтавкиНДС") <> Объект.ВидСтавкиНДС тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная номенклатура " + Строка(Значение) + " имеет отличную ставку НДС, от выбранной в текущем элементе!");
				
			Иначе
				
				Если НЕ ЗаполнилиТекущуюСтроку тогда
					СтрокаДляЗаполнения = Объект.Номенклатура.НайтиПоИдентификатору(Элементы.Номенклатура.ТекущаяСтрока);
					ЗаполнилиТекущуюСтроку = Истина;
				Иначе
					СтрокаДляЗаполнения = Объект.Номенклатура.Добавить();
				КонецЕсли;
				
				СтрокаДляЗаполнения.Номенклатура = Значение;
				СтрокаДляЗаполнения.КоэффициентГосЗакупок = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
